Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM3204PL10020.svd
               <register>
                  <name>OUTSET</name>
                  <description>Data Output Value Set</description>
                  <addressOffset>0x18</addressOffset>
                  <fields>
                     <field>
                        <name>OUT0SET</name>
                        <description>PORT Data Output Value 0 Set</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT1SET</name>
                        <description>PORT Data Output Value 1 Set</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT2SET</name>
                        <description>PORT Data Output Value 2 Set</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT3SET</name>
                        <description>PORT Data Output Value 3 Set</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT4SET</name>
                        <description>PORT Data Output Value 4 Set</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT5SET</name>
                        <description>PORT Data Output Value 5 Set</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT6SET</name>
                        <description>PORT Data Output Value 6 Set</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT7SET</name>
                        <description>PORT Data Output Value 7 Set</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT8SET</name>
                        <description>PORT Data Output Value 8 Set</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT9SET</name>
                        <description>PORT Data Output Value 9 Set</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT10SET</name>
                        <description>PORT Data Output Value 10 Set</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT11SET</name>
                        <description>PORT Data Output Value 11 Set</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT12SET</name>
                        <description>PORT Data Output Value 12 Set</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT13SET</name>
                        <description>PORT Data Output Value 13 Set</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT14SET</name>
                        <description>PORT Data Output Value 14 Set</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT15SET</name>
                        <description>PORT Data Output Value 15 Set</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT16SET</name>
                        <description>PORT Data Output Value 16 Set</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT17SET</name>
                        <description>PORT Data Output Value 17 Set</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT18SET</name>
                        <description>PORT Data Output Value 18 Set</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT19SET</name>
                        <description>PORT Data Output Value 19 Set</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT20SET</name>
                        <description>PORT Data Output Value 20 Set</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT21SET</name>
                        <description>PORT Data Output Value 21 Set</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT22SET</name>
                        <description>PORT Data Output Value 22 Set</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT23SET</name>
                        <description>PORT Data Output Value 23 Set</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT24SET</name>
                        <description>PORT Data Output Value 24 Set</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT25SET</name>
                        <description>PORT Data Output Value 25 Set</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT26SET</name>
                        <description>PORT Data Output Value 26 Set</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT27SET</name>
                        <description>PORT Data Output Value 27 Set</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT28SET</name>
                        <description>PORT Data Output Value 28 Set</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT29SET</name>
                        <description>PORT Data Output Value 29 Set</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT30SET</name>
                        <description>PORT Data Output Value 30 Set</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT31SET</name>
                        <description>PORT Data Output Value 31 Set</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>OUTTGL</name>
                  <description>Data Output Value Toggle</description>
                  <addressOffset>0x1C</addressOffset>
                  <fields>
                     <field>
                        <name>OUT0TGL</name>
                        <description>PORT Data Output Value 0 Toggle</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT1TGL</name>
                        <description>PORT Data Output Value 1 Toggle</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT2TGL</name>
                        <description>PORT Data Output Value 2 Toggle</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT3TGL</name>
                        <description>PORT Data Output Value 3 Toggle</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT4TGL</name>
                        <description>PORT Data Output Value 4 Toggle</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT5TGL</name>
                        <description>PORT Data Output Value 5 Toggle</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT6TGL</name>
                        <description>PORT Data Output Value 6 Toggle</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT7TGL</name>
                        <description>PORT Data Output Value 7 Toggle</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT8TGL</name>
                        <description>PORT Data Output Value 8 Toggle</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT9TGL</name>
                        <description>PORT Data Output Value 9 Toggle</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT10TGL</name>
                        <description>PORT Data Output Value 10 Toggle</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT11TGL</name>
                        <description>PORT Data Output Value 11 Toggle</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT12TGL</name>
                        <description>PORT Data Output Value 12 Toggle</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT13TGL</name>
                        <description>PORT Data Output Value 13 Toggle</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT14TGL</name>
                        <description>PORT Data Output Value 14 Toggle</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT15TGL</name>
                        <description>PORT Data Output Value 15 Toggle</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT16TGL</name>
                        <description>PORT Data Output Value 16 Toggle</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT17TGL</name>
                        <description>PORT Data Output Value 17 Toggle</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT18TGL</name>
                        <description>PORT Data Output Value 18 Toggle</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT19TGL</name>
                        <description>PORT Data Output Value 19 Toggle</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT20TGL</name>
                        <description>PORT Data Output Value 20 Toggle</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT21TGL</name>
                        <description>PORT Data Output Value 21 Toggle</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT22TGL</name>
                        <description>PORT Data Output Value 22 Toggle</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT23TGL</name>
                        <description>PORT Data Output Value 23 Toggle</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT24TGL</name>
                        <description>PORT Data Output Value 24 Toggle</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT25TGL</name>
                        <description>PORT Data Output Value 25 Toggle</description>
                        <bitOffset>25</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT26TGL</name>
                        <description>PORT Data Output Value 26 Toggle</description>
                        <bitOffset>26</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT27TGL</name>
                        <description>PORT Data Output Value 27 Toggle</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT28TGL</name>
                        <description>PORT Data Output Value 28 Toggle</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT29TGL</name>
                        <description>PORT Data Output Value 29 Toggle</description>
                        <bitOffset>29</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT30TGL</name>
                        <description>PORT Data Output Value 30 Toggle</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>OUT31TGL</name>
                        <description>PORT Data Output Value 31 Toggle</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
