Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM3204PL10020.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>SERCOM0</name>
         <version>U2201v1</version>
         <description>Serial Communication Interface</description>
         <groupName>SERCOM</groupName>
         <prependToName>SERCOM_</prependToName>
         <baseAddress>0x42000400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x31</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>SERCOM0</name>
            <value>7</value>
         </interrupt>
         <registers>
            <cluster>
               <name>I2CM</name>
               <description>I2C Host Mode</description>
               <headerStructName>SercomI2cm</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>I2CM Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>3</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>USART_EXT</name>
                              <description>USART with external clock</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART_INT</name>
                              <description>USART with internal clock</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_SLAVE</name>
                              <description>SPI Client mode</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI_MASTER</name>
                              <description>SPI Host mode</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_SLAVE</name>
                              <description>I2C Client mode</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>I2C_MASTER</name>
                              <description>I2C Host mode</description>
                              <value>0x5</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run in Standby</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PINOUT</name>
                        <description>Pin Usage</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SDAHOLD</name>
                        <description>SDA Hold Time</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SDAHOLDSelect</name>
                           <enumeratedValue>
                              <name>DIS</name>
                              <description>SDA hold time is disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>75NS</name>
                              <description>SDA hold time is 50-100 ns</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>450NS</name>
                              <description>SDA hold time is 300-600 ns</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>600NS</name>
                              <description>SDA hold time is 400-800 ns</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MEXTTOEN</name>
                        <description>Host SCL Low Extend Time-Out</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SEXTTOEN</name>
                        <description>Client SCL Low Extend Time-Out</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SPEED</name>
                        <description>Transfer Speed</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>SPEEDSelect</name>
                           <enumeratedValue>
                              <name>SM_MODE</name>
                              <description>Standard-mode (Sm) and Fast-mode (Fm)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FASTPLUS_MODE</name>
                              <description>Fast-mode Plus (Fm+)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SCLSM</name>
                        <description>SCL Clock Stretch Mode</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>INACTOUT</name>
                        <description>Inactive Time-Out</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>INACTOUTSelect</name>
                           <enumeratedValue>
                              <name>DIS</name>
                              <description>Disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>55US</name>
                              <description>5-6 SCL cycle time-out (50-60 us)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>105US</name>
                              <description>10-11 SCL cycle time-out (100-110 us)</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>205US</name>
                              <description>20-21 SCL cycle time-out (200-210 us)</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LOWTOUTEN</name>
                        <description>SCL Low Time-Out</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>I2CM Control B</description>
                  <addressOffset>0x4</addressOffset>
                  <fields>
                     <field>
                        <name>SMEN</name>
                        <description>Smart Mode Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>QCEN</name>
                        <description>Quick Command Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>ACKACT</name>
                        <description>Acknowledge Action</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD</name>
                  <description>I2CM Baud Rate</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Host Baud Rate</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>BAUDLOW</name>
                        <description>Host Baud Rate Low</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>I2CM Interrupt Enable Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>MB</name>
                        <description>Host on Bus Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SB</name>
                        <description>Client on Bus Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Error Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>I2CM Interrupt Enable Set</description>
                  <addressOffset>0x16</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToSet</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>MB</name>
                        <description>Host on Bus Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SB</name>
                        <description>Client on Bus Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Error Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>I2CM Interrupt Flag Status and Clear</description>
                  <addressOffset>0x18</addressOffset>
                  <size>8</size>
                  <modifiedWriteValues>oneToClear</modifiedWriteValues>
                  <fields>
                     <field>
                        <name>MB</name>
                        <description>Host on Bus</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SB</name>
                        <description>Client on Bus</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Error</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>I2CM Status</description>
                  <addressOffset>0x1A</addressOffset>
                  <size>16</size>
                  <fields>
                     <field>
                        <name>BUSERR</name>
                        <description>Bus Error</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ARBLOST</name>
                        <description>Arbitration Lost</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXNACK</name>
                        <description>Received Not Acknowledge</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>BUSSTATE</name>
                        <description>Bus State</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <writeConstraint>
                           <useEnumeratedValues>true</useEnumeratedValues>
                        </writeConstraint>
                        <enumeratedValues>
                           <name>BUSSTATESelect</name>
                           <enumeratedValue>
                              <name>UNKNOWN</name>
                              <description>The bus state is unknown to the I2C host, which will wait for a stop condition to be detected or for the bus to be forced into the IDLE state by software</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>IDLE</name>
                              <description>The bus state is waiting for a transaction to be initialized</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>OWNER</name>
                              <description>The I2C host is the current owner of the bus</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BUSY</name>
                              <description>Some other I2C host owns the bus</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LOWTOUT</name>
                        <description>SCL Low Time-Out</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLKHOLD</name>
                        <description>Clock Hold</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MEXTTOUT</name>
                        <description>Host SCL Low Extend Time-Out</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SEXTTOUT</name>
                        <description>Client SCL Low Extend Time-Out</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LENERR</name>
                        <description>Transaction Length Error</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>I2CM Synchronization Busy</description>
                  <addressOffset>0x1C</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>SERCOM Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SYSOP</name>
                        <description>System Operation Synchronization Busy</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ADDR</name>
                  <description>I2CM Address</description>
                  <addressOffset>0x24</addressOffset>
                  <fields>
                     <field>
                        <name>LENEN</name>
                        <description>Transfer Length Enable</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TENBITEN</name>
                        <description>Ten Bit Addressing Enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LEN</name>
                        <description>Transaction Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ADDR_SEVENBIT_MODE</name>
                  <description>I2CM Address</description>
                  <alternateRegister>ADDR</alternateRegister>
                  <addressOffset>0x24</addressOffset>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ADDR_TENBIT_MODE</name>
                  <description>I2CM Address</description>
                  <alternateRegister>ADDR</alternateRegister>
                  <addressOffset>0x24</addressOffset>
                  <fields>
                     <field>
                        <name>ADDR</name>
                        <description>Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>10</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA</name>
                  <description>I2CM Data</description>
                  <addressOffset>0x28</addressOffset>
                  <size>8</size>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
